-- Добавление данных в таблицу жанры. 
INSERT INTO `genre` (`id`, `genre_name`) VALUES (NULL, 'Фантастика'), (NULL, 'Детектив'), (NULL, 'Классика'), (NULL, 'Фэнтези'), (NULL, 'Современная проза');

-- Добавление данных в таблицу авторы. 
INSERT INTO `authors` (`id`, `name`, `last_name`) VALUES (NULL, 'Сергей', 'Лукьяненко'), (NULL, 'Вадим', 'Панов'),
(NULL, 'Алексей', 'Пехов'), (NULL, 'Алексей', 'Сальников'), (NULL, 'Евгений', 'Замятин'), (NULL, 'Павел', 'Корнев'),
(NULL, 'Алексей', 'Иванов'), (NULL, 'Дарья', 'Донцова'), (NULL, 'Наталья', 'Тимошенко'), (NULL, 'Аркадий', 'Стругацкий'), (NULL, 'Борис', 'Стругацкий');
INSERT INTO `authors` (`id`, `name`, `last_name`) VALUES (NULL, 'Елена', 'Бычкова'), (NULL, 'Наталья', 'Турчанинова');

-- Добавление данных в таблицу книги. 
INSERT INTO `books` (`id`, `ISBN`, `book_title`, `number_pages`, `publication_date`) VALUES 
(NULL, 'ISBN 978-5-6040083-1-7', 'Отдел', '432', '2018-04-11'),
(NULL, 'ISBN 978-5-17-106570-6', 'Петровы в гриппе и вокруг него', '411', '2020-01-24'),
(NULL, 'ISBN 978-5-9922-2139-8', 'Cоздатель кошмаров', '377', '2015-10-20'),
(NULL, 'ISBN 978-5-9922-1926-5', 'Мастер снов', '378', '2014-10-23'),
(NULL, 'ISBN 978-5-9922-2504-4', 'Эринеры гипноса', '377', '2017-07-13'),
(NULL, 'ISBN 978-5-9922-2007-0', 'Сиятельный', '377', '2017-10-17'),
(NULL, 'ISBN 978-5-04-089391-1', 'Занимательная механика', '416', '2017-08-24'),
(NULL, 'ISBN 978-5-17-108269-7', 'Мы', '320', '2018-03-05'),
(NULL, 'ISBN 978-5-04-089392-8', 'Ручной привод', '480', '2017-08-25'),
(NULL, 'ISBN 978-5-04-101744-6', 'Чудовищ .Net', '320', '2019-05-24'),
(NULL, 'ISBN 978-5-9922-2858-8', 'Созерцатель, Тень ингениума', '555', '2019-02-28');

-- Добавление данных в таблицу книги автора. 
INSERT INTO `authors_books` (`id_book`, `id_author`) VALUES ('1', '4'), ('2', '4'),
('3', '3'),
('4', '3'),
('5', '3'),
('6', '6'),
('7', '2'),
('8', '5'),
('9', '2'),
('10', '9'),
('11', '3'),
('3', '12'),
('3', '13'),
('4', '12'),
('4', '13'),
('5', '12'),
('5', '13');

-- Добавление данных в таблицу жанры книги. 
INSERT INTO `genres_book` (`id_book`, `id_genre`) VALUES ('1', '5'), ('2', '5')
, ('3', '1')
, ('4', '1')
, ('5', '1')
, ('6', '1')
, ('7', '1')
, ('8', '3')
, ('9', '1')
, ('10', '2')
, ('11', '1')
, ('11', '2')
, ('8', '1');
